# GetEnumerator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Categories..::..GetEnumerator Method
Categories Class See Also
---
Retrieves a forward moving iterator to the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override IEnumerator GetEnumerator()
```

Visual Basic
---
```text
Public Overrides Function GetEnumerator As IEnumerator
```

Visual C++
---
```text
public:
virtual IEnumerator^ GetEnumerator() override
```

# ### Return Value
A forward moving iterator to the map.
# ### Implements
IEnumerable..::..GetEnumerator()()()()
# See Also
Categories Class
Autodesk.Revit.DB Namespace